Ran Plan for dir: `infastructure/gcp/k8s_deployment/helm_nginx` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.gke_cluster: Reading...
data.terraform_remote_state.gke_cluster: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.helm.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ols-nginx"
      + namespace                  = "ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "4.7.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.autoscaling.enabled"
          + value = "true"
        }
      + set {
          + name  = "controller.autoscaling.maxReplicas"
          + value = "2"
        }
      + set {
          + name  = "controller.autoscaling.minReplicas"
          + value = "1"
        }
      + set {
          + name  = "controller.image.tag"
          + value = "v1.8.1"
        }
      + set {
          + name  = "controller.replicaCount"
          + value = "1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infastructure/gcp/k8s_deployment/helm_nginx`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.ols.blast.co.id/lock?id=greyhats13%252Fol_shop%252Finfastructure%252Fgcp%252Fk8s_deployment%252Fhelm_nginx%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infastructure/gcp/k8s_deployment/helm_nginx`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`